MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX150F256H.atdf
      <value-group caption="Power-on Reset Flag bit" name="RCON__POR">
         <value caption="Power-on Reset has occurred" name="" value="0x1" />
         <value caption="Power-on Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
         <value caption="Brown-out Reset has occurred" name="" value="0x1" />
         <value caption="Brown-out Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Idle Flag bit" name="RCON__IDLE">
         <value caption="Device was in Idle mode" name="" value="0x1" />
         <value caption="Device was not in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Sleep Flag bit" name="RCON__SLEEP">
         <value caption="Device was in Sleep mode" name="" value="0x1" />
         <value caption="Device was not in Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out Flag bit" name="RCON__WDTO">
         <value caption="WDT Time-out has occurred" name="" value="0x1" />
         <value caption="WDT Time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="" value="0x1" />
         <value caption="Software Reset as not executed" name="" value="0x0" />
      </value-group>
      <value-group caption="External Reset Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="" value="0x1" />
         <value caption="Master Clear (pin) Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Regulator Standby Enable bit" name="RCON__VREGS">
         <value caption="Regulator is enabled and is on during Sleep mode" name="" value="0x1" />
         <value caption="Regulator is set to Stand-by Tracking mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="Configuration mismatch Reset has occurred" name="" value="0x1" />
         <value caption="Configuration mismatch Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="High Voltage Detect Reset Flag bit" name="RCON__HVDR">
         <value caption="High Voltage Detect (HVD) Reset has occurred" name="" value="0x1" />
         <value caption="HVD Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Trigger bit" name="RSWRST__SWRST">
         <value caption="Enable software Reset event" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02495" name="RPIN" version="">
      <register-group name="RPIN">
         <register caption="Peripheral Pin Select Input Register" name="INT1R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT1R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="INT2R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT2R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="INT3R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT3R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="INT4R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT4R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="T2CKR" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T2CKR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="T3CKR" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T3CKR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="T4CKR" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T4CKR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="T5CKR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T5CKR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC1R" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC1R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC2R" offset="0x28" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC2R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC3R" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC3R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC4R" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC4R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC5R" offset="0x34" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC5R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC6R" offset="0x38" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC6R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC7R" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC7R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="IC8R" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC8R" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="OCFAR" offset="0x44" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="OCFAR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="OCFBR" offset="0x48" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="OCFBR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U1RXR" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U1RXR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U1CTSR" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U1CTSR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U2RXR" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U2RXR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U2CTSR" offset="0x58" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U2CTSR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U3RXR" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U3RXR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U3CTSR" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U3CTSR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U4RXR" offset="0x64" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U4RXR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U4CTSR" offset="0x68" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U4CTSR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U5RXR" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U5RXR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U5CTSR" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U5CTSR" />
         </register>
         <register caption="Peripheral Pin Select Input Register" name="U6RXR" offset="0x74" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U6RXR" />
         </register>
