MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX150F256H.atdf
      <value-group caption="Master Clock Enable bit" name="SPI3CON__MCLKSEL">
         <value caption="REFCLK is used by the Baud Rate Generator" name="" value="0x1" />
         <value caption="PBCLK is used by the Baud Rate Generator" name="" value="0x0" />
      </value-group>
      <value-group caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in FRAMED_SYNC mode." name="SPI3CON__FRMCNT">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Generate a frame sync pulse on every 32 data characters" name="" value="0x5" />
         <value caption="Generate a frame sync pulse on every 16 data characters" name="" value="0x4" />
         <value caption="Generate a frame sync pulse on every 8 data characters" name="" value="0x3" />
         <value caption="Generate a frame sync pulse on every 4 data characters" name="" value="0x2" />
         <value caption="Generate a frame sync pulse on every 2 data characters" name="" value="0x1" />
         <value caption="Generate a frame sync pulse on every data character" name="" value="0x0" />
      </value-group>
      <value-group caption="Frame Sync Pulse Width bit" name="SPI3CON__FRMSYPW">
         <value caption="Frame sync pulse is one character wide" name="" value="0x1" />
         <value caption="Frame sync pulse is one clock wide" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Mode Slave Select Enable bit" name="SPI3CON__MSSEN">
         <value caption="Slave select SPI support enabled. The SS pin is automatically driven during transmission in Master mode. Polarity is determined by the FRMPOL bit." name="" value="0x1" />
         <value caption="Slave select SPI support is disabled." name="" value="0x0" />
      </value-group>
      <value-group caption="Frame Sync Polarity bit (Framed SPI mode only)" name="SPI3CON__FRMPOL">
         <value caption="Frame pulse is active-high" name="" value="0x1" />
         <value caption="Frame pulse is active-low" name="" value="0x0" />
      </value-group>
      <value-group caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" name="SPI3CON__FRMSYNC">
         <value caption="Frame sync pulse input (Slave mode)" name="" value="0x1" />
         <value caption="Frame sync pulse output (Master mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="Framed SPI Support bit" name="SPI3CON__FRMEN">
         <value caption="Framed SPI support is enabled (SSx pin used as FSYNC input/output)" name="" value="0x1" />
         <value caption="Framed SPI support is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Receive Buffer Full Status bit" name="SPI1STAT__SPIRBF">
         <value caption="Receive buffer SPIxRXB is full" name="" value="0x1" />
         <value caption="Receive buffer SPIxRXB is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Transmit Buffer Full Status bit" name="SPI1STAT__SPITBF">
         <value caption="Transmit not yet started SPITXB is full" name="" value="0x1" />
         <value caption="Transmit buffer is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Status bit" name="SPI1STAT__SPITBE">
         <value caption="Transmit buffer SPIxTXB is empty" name="" value="0x1" />
         <value caption="Transmit buffer SPIxTXB is not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" name="SPI1STAT__SPIRBE">
         <value caption="RX FIFO is empty (CRPTR = SWPTR)" name="" value="0x1" />
         <value caption="RX FIFO is not empty (CRPTR != SWPTR)" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="SPI1STAT__SPIROV">
         <value caption="A new data is completely received and discarded. The user software has not read the previous data in the SPIxBUF register." name="" value="0x1" />
         <value caption="No overflow has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Shift Register Empty bit (valid only when ENHBUF = 1)" name="SPI1STAT__SRMT">
         <value caption="When SPI module shift register is empty" name="" value="0x1" />
         <value caption="When SPI module shift register is not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Under Run bit" name="SPI1STAT__SPITUR">
         <value caption="Transmit buffer has encountered an underrun condition" name="" value="0x1" />
         <value caption="Transmit buffer has no underrun condition" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Activity Status bit" name="SPI1STAT__SPIBUSY">
         <value caption="SPI peripheral is currently busy with some transactions" name="" value="0x1" />
         <value caption="SPI peripheral is currently idle" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Frame Error status bit" name="SPI1STAT__FRMERR">
         <value caption="Frame error detected" name="" value="0x1" />
         <value caption="No Frame error detected" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Receive Buffer Full Status bit" name="SPI2STAT__SPIRBF">
         <value caption="Receive buffer SPIxRXB is full" name="" value="0x1" />
         <value caption="Receive buffer SPIxRXB is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Transmit Buffer Full Status bit" name="SPI2STAT__SPITBF">
         <value caption="Transmit not yet started SPITXB is full" name="" value="0x1" />
         <value caption="Transmit buffer is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Status bit" name="SPI2STAT__SPITBE">
         <value caption="Transmit buffer SPIxTXB is empty" name="" value="0x1" />
         <value caption="Transmit buffer SPIxTXB is not empty" name="" value="0x0" />
      </value-group>
