MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX150F256H.atdf
      <value-group caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" name="SPI2STAT__SPIRBE">
         <value caption="RX FIFO is empty (CRPTR = SWPTR)" name="" value="0x1" />
         <value caption="RX FIFO is not empty (CRPTR != SWPTR)" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="SPI2STAT__SPIROV">
         <value caption="A new data is completely received and discarded. The user software has not read the previous data in the SPIxBUF register." name="" value="0x1" />
         <value caption="No overflow has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Shift Register Empty bit (valid only when ENHBUF = 1)" name="SPI2STAT__SRMT">
         <value caption="When SPI module shift register is empty" name="" value="0x1" />
         <value caption="When SPI module shift register is not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Under Run bit" name="SPI2STAT__SPITUR">
         <value caption="Transmit buffer has encountered an underrun condition" name="" value="0x1" />
         <value caption="Transmit buffer has no underrun condition" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Activity Status bit" name="SPI2STAT__SPIBUSY">
         <value caption="SPI peripheral is currently busy with some transactions" name="" value="0x1" />
         <value caption="SPI peripheral is currently idle" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Frame Error status bit" name="SPI2STAT__FRMERR">
         <value caption="Frame error detected" name="" value="0x1" />
         <value caption="No Frame error detected" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Receive Buffer Full Status bit" name="SPI3STAT__SPIRBF">
         <value caption="Receive buffer SPIxRXB is full" name="" value="0x1" />
         <value caption="Receive buffer SPIxRXB is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Transmit Buffer Full Status bit" name="SPI3STAT__SPITBF">
         <value caption="Transmit not yet started SPITXB is full" name="" value="0x1" />
         <value caption="Transmit buffer is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Status bit" name="SPI3STAT__SPITBE">
         <value caption="Transmit buffer SPIxTXB is empty" name="" value="0x1" />
         <value caption="Transmit buffer SPIxTXB is not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" name="SPI3STAT__SPIRBE">
         <value caption="RX FIFO is empty (CRPTR = SWPTR)" name="" value="0x1" />
         <value caption="RX FIFO is not empty (CRPTR != SWPTR)" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="SPI3STAT__SPIROV">
         <value caption="A new data is completely received and discarded. The user software has not read the previous data in the SPIxBUF register." name="" value="0x1" />
         <value caption="No overflow has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Shift Register Empty bit (valid only when ENHBUF = 1)" name="SPI3STAT__SRMT">
         <value caption="When SPI module shift register is empty" name="" value="0x1" />
         <value caption="When SPI module shift register is not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Under Run bit" name="SPI3STAT__SPITUR">
         <value caption="Transmit buffer has encountered an underrun condition" name="" value="0x1" />
         <value caption="Transmit buffer has no underrun condition" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Activity Status bit" name="SPI3STAT__SPIBUSY">
         <value caption="SPI peripheral is currently busy with some transactions" name="" value="0x1" />
         <value caption="SPI peripheral is currently idle" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Frame Error status bit" name="SPI3STAT__FRMERR">
         <value caption="Frame error detected" name="" value="0x1" />
         <value caption="No Frame error detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Audio Protocol Mode bit" name="SPI1CON2__AUDMOD">
         <value caption="PCM/DSP mode" name="" value="0x3" />
         <value caption="Right Justified mode" name="" value="0x2" />
         <value caption="Left Justified mode" name="" value="0x1" />
         <value caption="I2S mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Audio Data Format bit" name="SPI1CON2__AUDMONO">
         <value caption="Audio data is mono (Each data word is transmitted on both left and right channels)" name="" value="0x1" />
         <value caption="Audio data is stereo" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Audio CODEC Support bit" name="SPI1CON2__AUDEN">
         <value caption="Audio protocol enabled" name="" value="0x1" />
         <value caption="Audio protocol disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Ignore Transmit Underrun bit" name="SPI1CON2__IGNTUR">
         <value caption="A TUR is not a critical error and zeros are transmitted until the SPIxTXB is not empty" name="" value="0x1" />
         <value caption="A TUR is a critical error which stop SPI operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Ignore Receive Overflow bit" name="SPI1CON2__IGNROV">
         <value caption="A ROV is not a critical error; during ROV data in the fifo is not overwritten by receive data" name="" value="0x1" />
         <value caption="A ROV is a critical error which stop SPI operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Interrupt Events via SPITUR bit" name="SPI1CON2__SPITUREN">
         <value caption="Transmit Underrun Generates Error Events" name="" value="0x1" />
         <value caption="Transmit Underrun Does Not Generates Error Events" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Interrupt Events via SPIROV bit" name="SPI1CON2__SPIROVEN">
         <value caption="Receive overflow generates error events" name="" value="0x1" />
         <value caption="Receive overflow does not generate error events" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Interrupt Events via FRMERR bit" name="SPI1CON2__FRMERREN">
         <value caption="Frame Error overflow generates error events" name="" value="0x1" />
         <value caption="Frame Error does not generate error events" name="" value="0x0" />
      </value-group>
      <value-group caption="Sign Extend Read Data from the RX FIFO bit" name="SPI1CON2__SPISGNEXT">
         <value caption="Data from RX FIFO is sign extended" name="" value="0x1" />
         <value caption="Data from RX FIFO is not sign extened" name="" value="0x0" />
      </value-group>
      <value-group caption="Audio Protocol Mode bit" name="SPI2CON2__AUDMOD">
         <value caption="PCM/DSP mode" name="" value="0x3" />
         <value caption="Right Justified mode" name="" value="0x2" />
         <value caption="Left Justified mode" name="" value="0x1" />
         <value caption="I2S mode" name="" value="0x0" />
      </value-group>
